"UPFuturesTradeRefreshRefreshHeaderIdleText" = "Pull down to refresh";
"UPFuturesTradeRefreshRefreshHeaderPullingText" = "Release to refresh";
"UPFuturesTradeRefreshRefreshHeaderRefreshingText" = "Loading...";

"UPFuturesTradeRefreshRefreshAutoFooterIdleText" = "Tap or pull up to load more";
"UPFuturesTradeRefreshRefreshAutoFooterRefreshingText" = "Loading...";
"UPFuturesTradeRefreshRefreshAutoFooterNoMoreDataText" = "No more data";

"UPFuturesTradeRefreshRefreshBackFooterIdleText" = "Pull up to load more";
"UPFuturesTradeRefreshRefreshBackFooterPullingText" = "Release to load more.";
"UPFuturesTradeRefreshRefreshBackFooterRefreshingText" = "Loading...";
"UPFuturesTradeRefreshRefreshBackFooterNoMoreDataText" = "No more data";

"UPFuturesTradeRefreshRefreshHeaderLastTimeText" = "Last update:";
"UPFuturesTradeRefreshRefreshHeaderDateTodayText" = "Today";
"UPFuturesTradeRefreshRefreshHeaderNoneLastDateText" = "No record";
